{"sections":{"default":{"type":"terms-conditions-v2","blocks":{"terms_k6BCj6":{"type":"terms","settings":{"heading":"Welcome","content":"<p>Welcome to Y&CO! These Terms and Conditions govern your use of our website and services. By accessing or using our website, you agree to comply with these terms. Please read them carefully.<\/p>"}},"terms_xYKrUz":{"type":"terms","settings":{"heading":"T & C","content":"<p>1. Use of Website<\/p><p>1.1 You may use our website for lawful purposes only.<\/p><p>1.2 You are responsible for maintaining the confidentiality of your account information and for restricting access to your account.<\/p><p>1.3 You agree not to engage in any activity that may disrupt or interfere with the functioning of our website.<\/p><p>2. Products and Services<\/p><p>2.1 Our products and services are provided \"as is\" without any warranty or guarantee.<\/p><p>2.2 We reserve the right to modify, suspend, or discontinue any product or service at any time without prior notice.<\/p><p><\/p><p>3. Ordering and Payment<\/p><p>3.1 By placing an order, you agree to pay the full amount specified at the time of purchase.<\/p><p>3.2 We accept payment via the methods listed on our website. Payment processing is handled by third-party payment processors, and we do not store your payment information.<\/p><p>3.3 Prices are subject to change without notice, and we are not responsible for any errors in pricing or product descriptions.<\/p><p>3.4 We ensure that the displayed price and currency at the checkout page, will be the same price and currency printed on the Transaction Receipt and the amount charged to the card will be shown in your card currency.<\/p><p>3.5 We will not trade with or provide any services to OFAC and sanctioned countries.<\/p><p>3.6 We accept all major Visa or MasterCard, debit and credit cards in AED for payment.<\/p><p><\/p><p>4. Shipping and Delivery<\/p><p>4.1 We will make every effort to ensure timely delivery of your orders. However, we are not liable for delays caused by factors beyond our control, such as shipping carriers or customs clearance.<\/p><p>4.2 Shipping costs and delivery times may vary depending on your location and the shipping method selected.<\/p><p>4.3 Our products are carefully packaged to ensure they arrive in perfect condition. Each item is securely wrapped to prevent any damage during transit, so you can receive your purchase in the best condition.<br\/><br\/>What should I do if a product is damaged in shipping or isn’t the product I ordered?<br\/><br\/>We want every Y&CO order to arrive in perfect condition! If you receive a damaged item or an incorrect product, please contact us immediately with your order number and a photo of the issue. Our team will quickly work on a solution to replace or refund the item so you can keep shopping with confidence.<br\/><br\/>4.4 Shipping costs are based on your order’s size, weight, and delivery location. All charges will be displayed before you complete your purchase.<\/p><p>4.5 Currently, we only offer shipping within the UAE. We are dedicated to providing exceptional service to our UAE-based customers, and we hope to expand our shipping options internationally in the future.<\/p><p>4.6 Upon successfully placing your order, a confirmation page will display your order details. Additionally, you will receive an email confirmation with all relevant order information. If you do not receive this email, please check your spam folder or contact our support team to confirm your order status.<br\/><br\/>4.7 If you need to modify or cancel your order, please reach out to us as soon as possible. We will make every effort to accommodate changes or cancellations, provided your order has not yet shipped. If the order has already been dispatched, our team can assist you with our return or exchange options.<br\/><br\/><\/p><p>5. Returns and Exchanges<\/p><p>5.1 We accept returns and exchanges within 15 days of purchase, subject to our Return Policy.<\/p><p>5.2 Items must be returned in their original condition, and you may be responsible for return shipping costs.<\/p><p><\/p><p>6. Intellectual Property.<\/p><p>6.1 All content on our website, including text, images, logos, and trademarks, is the property of Y&CO or its licensors and is protected by copyright and other intellectual property laws.<\/p><p>6.2 You may not reproduce, distribute, or modify any content from our website without prior written consent.<\/p><p><\/p><p>7. Limitation of Liability<\/p><p>7.1 In no event shall Y&CO be liable for any indirect, incidental, special, or consequential damages arising out of or in connection with your use of our website or services.<\/p><p>7.2 Our total liability to you for any claim arising out of or in connection with these Terms and Conditions shall not exceed the amount paid by you for the products or services in question.<\/p><p><\/p><p>8. Changes to Terms and Conditions<\/p><p>8.1 We reserve the right to modify or update these Terms and Conditions at any time. Any changes will be effective immediately upon posting on our website.<\/p><p><\/p><p>9. Laws and Regulations<\/p><p><br\/>9.1 Y N C APPAREL TRADING L.L.C. is the owner and operator of the website www.yandco.ae. All intellectual property rights are protected by \"Y N C APPAREL TRADING L.L.C\" <\/p><p>9.2 At www.yandco.ae, we are fully committed to operating our business in strict adherence to the laws and regulations set forth by the United Arab Emirates (UAE) government. We recognize the importance of conducting business ethically and responsibly, and we strive to maintain the highest standards of compliance with all local requirements.<\/p><p>9.3 Any purchase, dispute or claim arising out of or in connection with this website shall be governed and construed in accordance with the laws of UAE.<\/p><p><\/p><p>10. User Privacy<br\/><br\/>10.1 Our website is intended for children under the age of 13, as well as parents or guardians shopping on behalf of their children.<br\/><\/p><p>10.2 User is responsible for maintaining the confidentiality of his\/her account.<\/p><p>10.3 We send an invoice to registered mail after checkout record. For any claim, Cardholder must retain a copy of transaction records.<br\/><\/p><p>11. Contact Us<\/p><p>11.1 If you have any questions or concerns about these Terms and Conditions, please contact us at <strong>support@yandco.ae<\/strong><\/p><p>By using our website or services, you agree to be bound by these Terms and Conditions. If you do not agree with any part of these terms, please do not use our website.<\/p>"}}},"block_order":["terms_k6BCj6","terms_xYKrUz"],"settings":{"subtitle":"Terms and Conditions outline the rules, rights, and responsibilities   that govern the use of our products."}}},"order":["default"]}