{"sections":{"default":{"type":"about-v2","blocks":{"value_fMDrLX":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Creativity.png","value_title":"Creativity","value_des":"<p>We infuse creativity into every design, crafting playful, unique, and timeless pieces that reflect the magic of childhood. Our goal is to inspire confidence and imagination, ensuring every child feels celebrated and excited to wear our clothing. <\/p>"}},"value_GfTj9y":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Quality.png","value_title":"Quality","value_des":"<p>We are committed to ensure exceptional quality by using toxic-free materials, conducting strict testing, and maintaining precise craftsmanship. Every piece reflects our commitment to comfort, durability, and style, giving our customers the best they deserve.<\/p>"}},"value_6Cffgw":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Inclusivity.png","value_title":"Inclusivity","value_des":"<p>We embrace inclusivity by offering a diverse range of designs, sizes, and styles that cater to every child. Our commitment ensures children of all backgrounds feel seen, valued, and represented in everything we create. <\/p>"}},"value_3xLrV8":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Sustainability.png","value_title":"Sustainability","value_des":"<p>We prioritize sustainability by sourcing eco-friendly materials, minimizing waste, and ensuring ethical production processes. Every step reflects our dedication to creating clothing that’s kind to the planet while preserving its beauty for future generations. <\/p>"}},"value_HakmF9":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Community.png","value_title":"Community","value_des":"<p>We value community by partnering with charities, supporting local artisans, and promoting family-focused initiatives. Our mission is to give back, fostering connections that enrich the lives of children and families, and strengthen the bonds within our society.<\/p>"}},"value_PyTz6U":{"type":"value","settings":{"value_icon":"shopify:\/\/shop_images\/Integrity.png","value_title":"Integrity","value_des":"<p>We are committed to honesty and transparency in all we do, from our sourcing to our customer relationships. Building trust with our customers and partners is essential, and we uphold the highest ethical standards to reflect our dedication.<\/p>"}}},"block_order":["value_fMDrLX","value_GfTj9y","value_6Cffgw","value_3xLrV8","value_HakmF9","value_PyTz6U"],"settings":{"page_title":"<p>About Us<\/p>","description_1":"<p>Welcome to Y&CO, where every stitch tells a story and every outfit sparks imagination. Established in the vibrant heart of the United Arab Emirates, Y&CO is more than just a fashion brand; it's a celebration of childhood, creativity, and cultural diversity.<\/p>","featured_image":"shopify:\/\/shop_images\/Group_685.png","description_2":"<p>At Y&CO, we believe that children's clothing should be more than just fabric and thread. It should embody the spirit of playfulness, individuality, and comfort. With this ethos at our core, we craft each garment with meticulous attention to detail, ensuring that every piece reflects the uniqueness of the child who wears it.<\/p><p>Our collections are inspired by the dynamic energy of the UAE, blending contemporary trends with traditional craftsmanship. From breezy beachwear to elegant evening attire, our designs cater to every occasion and style preference, ensuring that children can express themselves authentically at every moment.<\/p><p><\/p><p>But Y&CO is more than just a fashion label. It's a community built on inclusivity and empowerment. We celebrate the diversity of our customers, embracing different cultures, backgrounds, and identities. Our commitment to sustainability is woven into every aspect of our operations.<\/p><p><\/p><p>Whether it's a playful romper for a toddler or a sophisticated ensemble for a young fashionista, Y&CO is where style meets substance, where fashion meets function, and where every child can shine brightly.<\/p>","mission":"<p>At Y&CO, our mission is to inspire and empower children to embrace their uniqueness, express themselves authentically, and pursue their dreams with confidence. <\/p><p>We strive to create exceptional clothing that not only reflects the latest trends but also celebrates diversity, fosters creativity, and promotes sustainability. Through our designs, initiatives, and community engagement, we aim to leave a positive impact on the world, one stitch at a time.<\/p>","vision":"<p>Our vision at Y&CO is to be the premier destination for stylish and sustainable children's fashion in the UAE and beyond. We envision a world where every child feels empowered to showcase their individuality through their clothing, where diversity is celebrated, and where our commitment to ethical practices sets the standard for the industry. <\/p><p>By continuously innovating, collaborating, and uplifting our community, we aspire to create a brighter, more inclusive future for generations to come.<\/p>"}}},"order":["default"]}