{"sections":{"default":{"type":"return-refund-v2","blocks":{"policy_HVw9Dd":{"type":"policy","settings":{"heading":"Returns and Exchanges","content":"<p>Are you unsatisfied with your recent purchase? Returning a product on Y&CO is now hassle-free. You have a 15-day grace period from the day of receipt to return products in their original condition, accompanied by proof of purchase. Whether it's a change of heart or an issue with the product, we've got you covered.Y&CO return process ensures your shopping experience is smooth and trustworthy.<\/p>"}},"policy_7qRqwb":{"type":"policy","settings":{"heading":"Exchanges","content":"<p>Didn't get the right size or color? No problem! You may exchange items purchased from Y&CO within 15 days of receipt. Just ensure the item is in its original packaging with tags attached, and provide proof of purchase for a seamless exchange experience.<\/p>"}},"policy_nJDA3P":{"type":"policy","settings":{"heading":"Return Policy","content":"<p>If your product is damaged, defective, incorrect, or incomplete upon delivery, initiate a return request within 15 days on the Y&CO website. Navigate through Y&CO’s straightforward return protocols and ensure a smooth shopping experience every time. Your journey towards resolving any purchase issues on Y&CO is just a click away.<\/p>"}},"policy_QKNLjK":{"type":"policy","settings":{"heading":"Return Package Requirements","content":"<p>To ensure a smooth return process and avoid any delays, please make sure to include the Order Number and Return Tracking Number on your return package. This information is essential for us to accurately process your return and issue your refund promptly. Failure to provide this information may result in a delay or inconvenience in processing your return.<\/p>"}},"policy_PiENjm":{"type":"policy","settings":{"heading":"Return Rejection Policy","content":"<p>We strive to uphold the highest standards of quality and service for our customers. If your returned item does not meet the requirements outlined in our Return Policy, we reserve the right to reject the request for a refund. It is important to adhere to our return guidelines to ensure a fair and efficient process for all parties involved.<\/p>"}},"policy_eFqQQ6":{"type":"policy","settings":{"heading":"Consequences of Return Rejection","content":"<p>If your return request is rejected due to failure to meet our return requirements, the item will be returned to you within 6-8 days. Please note that if the item is not successfully delivered after three (3) attempts, it will be sent to scrap, and no refund will be provided. We kindly ask for your cooperation in adhering to our return guidelines to avoid any inconvenience or disappointment.<\/p>"}},"policy_DB4p7n":{"type":"policy","settings":{"heading":"Your Cooperation Matters","content":"<p>Your cooperation in following our return guidelines is greatly appreciated and helps us maintain the quality of our products and services. If you have any questions or concerns regarding our return process or requirements, please feel free to contact our customer service team for assistance. We are here to ensure that your shopping experience with us is enjoyable and hassle-free.<\/p>"}},"policy_3eg9Wa":{"type":"policy","settings":{"heading":"Categories Eligible for Return","content":"<p>Certain categories allow for a change of mind. However, we prioritize your peace of mind. Categories eligible for return include damaged, defective, incorrect, or incomplete items upon delivery. We want you to love what you've ordered, and if it's not right, we'll make it right.<\/p>"}},"policy_qRRGXn":{"type":"policy","settings":{"heading":"Selected Categories with Change of Mind","content":"<p>While certain categories offer flexibility for change of mind returns, there are exceptions to ensure fairness to all customers. Personalized items, sale items, products with extended delivery times, and items in 'Special Sale' categories are excluded from our standard Return & Refund Policy. Additionally, products lacking original packaging, tags, or showing signs of use, tear, or alteration are ineligible for return or refund.<\/p>"}},"policy_YhQeMx":{"type":"policy","settings":{"heading":"Refunds","content":"<p>Your satisfaction is our priority, and we aim to process refunds swiftly and efficiently. Refunds will be processed within 15 days after receipt of the return. Alternatively, you're welcome to visit our store or warehouse free of charge. All returns must be traceable as we are not responsible for losses.<\/p>"}},"policy_atgtkt":{"type":"policy","settings":{"heading":"Refund Process","content":"<p>The processing time for your refund depends on the refund type and payment method. Refunds cover the item price and shipping fee. We understand the importance of transparency and accessibility, so feel free to reach out to our customer service team for any assistance or inquiries regarding your refund.<\/p>"}},"policy_3aMzE4":{"type":"policy","settings":{"heading":"Conditions for Return & Refund","content":"<p>To ensure a smooth return and refund process, please adhere to the following conditions:<\/p><ul><li>The product must be unused, unworn ( Specially Underwear and similar products ), unwashed and without any flaws. For fashion products, products may be tried (exclude Underwear and similar products)  on to see if the item fits. This will still be considered as unworn.<\/li><li>Products must be in their original tags,Invoice undamaged manufacturer's packaging\/box, as we consider boxes to be part of the product's condition.<\/li><li>We will not accept products that have been used, damaged, or washed.<\/li><li>Clothes with burn marks or scorching cannot be returned.<\/li><li>We cannot accept clothes that are wet, water-damaged, or show signs of exposure to moisture.<\/li><li>For hygiene reasons, undergarments must remain unworn when returned.<\/li><li>All returns must be accompanied by the original order confirmation.<\/li><li>Liability<\/li><\/ul><p>We take full liability for any errors or discrepancies in your order. If you did not receive the product you ordered or the right size, we will rectify the issue promptly and cover the shipping costs for the replacement.<\/p>"}},"policy_PHnaJE":{"type":"policy","settings":{"heading":"Refund Methods","content":"<p>For your convenience, refunds will be processed according to the payment method you selected during the ordering process. Debit or credit card refunds typically take 5 to 10 working days to reflect in your account.<\/p>"}},"policy_hdTwTG":{"type":"policy","settings":{"heading":"Exclusions","content":"<p>Certain products are not eligible for returns:<\/p><ul><li>Sale items<\/li><li>Personalized items<\/li><li>Products with extended delivery times<\/li><li>Items in 'Special Sale' categories<\/li><li>Products without original packaging and tags<\/li><\/ul><p>Products not in pristine condition or showing signs of use, tear, or alteration.<\/p><p>We value your trust and strive to provide the best shopping experience possible. If you have any questions or concerns regarding our Return & Refund Policy, please don't hesitate to contact us. Your satisfaction is our top priority, and we're here to help every step of the way.<\/p>"}}},"block_order":["policy_HVw9Dd","policy_7qRqwb","policy_nJDA3P","policy_QKNLjK","policy_PiENjm","policy_eFqQQ6","policy_DB4p7n","policy_3eg9Wa","policy_qRRGXn","policy_YhQeMx","policy_atgtkt","policy_3aMzE4","policy_PHnaJE","policy_hdTwTG"],"settings":{"subtitle":"A return allows you to give an item back to the store, while a refund is getting your money back for the returned item."}}},"order":["default"]}