{"sections":{"default":{"type":"faq-v2","blocks":{"faq_tqbG3N":{"type":"faq","settings":{"select_topic":"general_information","heading-1":"What is Y&CO?","content-1":"<p>Y&CO is a beloved and inspiring brand in children’s fashion, dedicated to creating joyful, stylish, and thoughtfully designed clothing that sparks confidence and individuality in every child. Based in UAE, with a passion for quality, comfort, and sustainability, Y&CO crafts pieces that embrace the wonder of childhood. Rooted in excellence and driven by innovation, Y&CO combines modern design with impeccable craftsmanship to bring unique, vibrant collections to life.<\/p>","heading-2":"What is the benefit of buying from Y&CO?","content-2":"<p>When you shop with Y&CO, you’re choosing quality, creativity, and integrity. Our clothes are designed to be stylish yet practical, with a strong commitment to sustainable practices. We ensure all our materials are eco-friendly and our production process is ethical, so you can feel worthy about dressing your child in our clothes.<\/p>","heading-3":"What products does Y&CO sell?","content-3":"<p>Y&CO offers a wide range of kids' clothing, including tops, bottoms, dresses, outerwear, and innerwear. We design each collection with the latest trends in mind while prioritizing comfort and durability, so your child’s wardrobe is both versatile and fun.<\/p>","heading-4":"Why should I choose Y&CO for my child’s clothing?","content-4":"<p>At Y&CO we are dedicated to providing stylish, comfortable, and eco-friendly clothing that kids love to wear. We care for each kid’s comfort and want to make their childhood safe with our eco-friendly materials and ethical production methods. Our designs are crafted with creativity and inclusivity in mind that ensures every child feels comfortable and confident in our clothes.<\/p>","heading-5":"Are Y&CO products weather-friendly for the UAE?","content-5":"<p>Yes, Y&CO designs are carefully crafted to suit the UAE's climate. Our clothing is made with lightweight fabrics that are perfect for warmer temperatures while offering comfort and style for the cooler months. We prioritize materials that keep kids comfortable in the region’s diverse weather conditions.<\/p>"}},"faq_NncJLL":{"type":"faq","settings":{"select_topic":"general_information","heading-1":"Are your products suitable for the UAE's sunny conditions?","content-1":"<p>Absolutely! Many of our designs are made for sun-friendly weather to keep kids comfortable in the UAE’s bright sunshine. We understand the importance of clothing that supports active play while offering protection.<\/p>","heading-2":"Does Y&CO have a physical store in the UAE?","content-2":"<p>At this time, Y&CO operates exclusively online, making it easy for customers across the UAE to shop from the comfort of their homes. Stay tuned for updates as we continue to expand our brand presence.<\/p>","heading-3":"What if an item is out of stock?","content-3":"<p>If an item you’re interested in is out of stock, we recommend following our website and social media to stay updated on restocking products. You can also reach out to our customer service team for updates on restocks.<\/p>","heading-4":"How are the products packaged?","content-4":"<p>Our products are carefully packaged to ensure they arrive in perfect condition. Each item is securely wrapped to prevent any damage during transit, so you can receive your purchase in the best condition.<\/p>","heading-5":"What happens if I am not available at the time of delivery?","content-5":"<p>If you are unavailable at the time of delivery, our courier will attempt delivery at a later time or may contact you to reschedule. In some ases, the package may be left at a secure location or returned to the nearest courier facility for pickup. You can contact the courier service directly with your tracking number for assistance.<\/p>"}},"faq_8GHXb6":{"type":"faq","settings":{"select_topic":"general_information","heading-1":"Does Y&CO save any credit card information for future use?","content-1":"<p>No, Y&CO does not save any credit card information. We value our customers' privacy and do not store any payment information in our system. <\/p>","heading-2":"Is my personal data safe with Y&CO? ","content-2":"<p>Yes, your personal data is completely safe with us. At Y&CO, we are committed to protecting your confidential information and ensuring all customer data is securely managed.<\/p>","heading-3":"How can I stay updated on new arrivals and promotions?","content-3":"<p>The best way to stay updated about our latest collections and special offers is by signing up for our newsletter. You can also follow us on social media for updates, styling tips, and exclusive promotions.<\/p>","heading-4":"Who can I contact if I have questions or need assistance?","content-4":"<p>Our customer service team is here to help! You can reach out via email, social media or live chat, and we’ll get back to you as quickly as possible. We’re dedicated to ensuring you have a great experience with Y&CO.<\/p>","heading-5":"","content-5":""}},"faq_T7NygX":{"type":"faq","settings":{"select_topic":"order","heading-1":"How do I place an order on Y&CO?","content-1":"<p>To place an order, simply browse our collection, select your preferred items, choose the appropriate size and color, and click <strong>Add to Cart<\/strong>. When you’re ready to complete your purchase, proceed to your cart, select <strong>Checkout<\/strong>, and follow the prompts to enter your shipping and payment information. <\/p>","heading-2":"How do I know if my order was successful?","content-2":"<p>Upon successfully placing your order, a confirmation page will display your order details. Additionally, you will receive an email confirmation with all relevant order information. If you do not receive this email, please check your spam folder or contact our support team to confirm your order status.<\/p>","heading-3":"Can I change or cancel my order after it’s been confirmed?","content-3":"<p>If you need to modify or cancel your order, please reach out to us as soon as possible. We will make every effort to accommodate changes or cancellations, provided your order has not yet shipped. If the order has already been dispatched, our team can assist you with our return or exchange options.<\/p>","heading-4":"What should I do if a product is damaged in shipping or isn’t the product I ordered?","content-4":"<p>We want every Y&CO order to arrive in perfect condition! If you receive a damaged item or an incorrect product, please contact us immediately with your order number and a photo of the issue. Our team will quickly work on a solution to replace or refund the item so you can keep shopping with confidence.<\/p><p>As per <a href=\"\/pages\/refund-policy\" title=\"Return & Refund Policy\">Return & Refund<\/a> Policies<\/p>","heading-5":"Can I customize an order for my child?","content-5":"<p>Currently, we do not offer custom designs, but we’re always open to feedback! We love hearing from our customers and are constantly working to expand our styles based on your preferences. <\/p>"}},"faq_QWAAEB":{"type":"faq","settings":{"select_topic":"payment","heading-1":"What payment methods do you accept?","content-1":"<p>We accept all major Visa or MasterCard, debit and credit cards in AED for payment.<\/p>","heading-2":"Why is my payment not going through?","content-2":"<p>If your payment isn’t processing, it may be due to factors such as insufficient funds, an incorrect card number, or an expired card. Please verify your information and try again. If the issue persists, we recommend contacting your bank or reaching out to our customer service team for further assistance.<\/p>","heading-3":"Are there any other hidden charges? ","content-3":"<p>Y&CO believes in transparency, so there are no hidden charges beyond what is displayed at checkout. However, depending on your location, additional taxes may apply, which will be calculated and shown at checkout if applicable.<\/p>","heading-4":"What is VAT?","content-4":"<p>VAT (Value Added Tax) is a consumption tax that applies to the sale of goods and services. For our customers, VAT is included in the total price displayed on our website, so you don’t have to worry about additional charges at checkout.<\/p>","heading-5":"Will my VAT amount be refunded on order cancellation and returns?","content-5":"<p>Yes, if you cancel or return an order, any VAT charged will be included in your refund. Once the return is processed, you will receive the full eligible amount, including VAT, back to your original payment method.<\/p>"}},"faq_AUHQwH":{"type":"faq","settings":{"select_topic":"shipping","heading-1":"What are the shipping charges?","content-1":"<p>A Shipping Charge is the fee added to your order to cover the cost of delivering items from the seller's location to your specified address. Shipping charges vary depending on your location and the total weight of your order. The specific shipping cost will be calculated and displayed at checkout before you complete your purchase.<\/p>","heading-2":"Who pays for the shipping charges?","content-2":"<p>Customers are responsible for paying shipping charges on each order unless otherwise specified in a promotion. Occasionally, we may offer free shipping on orders over a certain amount or during special events.<\/p>","heading-3":"If I cancel my order, will I get back the amount I paid as a shipping charge?","content-3":"<p>If your order is canceled before it is shipped, any shipping charge paid will be fully refunded along with the order amount. If the cancellation is requested after shipping, the refund may exclude shipping charges depending on the circumstances.<\/p>","heading-4":"If I return my order, will I get back the amount I paid as a shipping charge?","content-4":"<p>For returns, the original shipping charge is typically not refunded. However, in cases where the return is due to a defect or mistake on our part, we may refund the shipping charge along with the product amount. Please refer to our <strong>Return Policy<\/strong> for specific details.<\/p>","heading-5":"If I place an exchange request, do I need to pay a shipping charge again for the new product?","content-5":"<p>If you request an exchange, a new shipping charge may apply. However, we occasionally offer free shipping in exchange for items of the same value. For details, please reach out to our customer service team.<\/p>"}},"faq_RdcjKH":{"type":"faq","settings":{"select_topic":"shipping","heading-1":"How can I avoid shipping charges?","content-1":"<p>You may qualify for free shipping by reaching a minimum order amount or during promotional events. Sign up for our newsletter to stay updated on offers and free shipping promotions. You can collect your product directly from our warehouse to avoid shipping charges.<\/p>","heading-2":"Will the shipping charge depend on my delivery location?","content-2":"<p>Yes, shipping charges may vary based on your delivery location. We aim to keep shipping costs as reasonable as possible, and the exact amount will be calculated at checkout.<\/p>","heading-3":"Will I be able to see my total shipping charges in the checkout?","content-3":"<p>The total shipping charge for your order will be displayed in the checkout. You’ll have complete clarity on all charges before completing your purchase.<\/p>","heading-4":"What are your shipping options and delivery times?","content-4":"<p>Y&CO offers reliable and timely shipping options across the UAE. Standard delivery typically takes <strong>48 hours<\/strong> from the date of order confirmation. We strive to process and dispatch orders as quickly as possible, and you will receive an email notification once your order has shipped.<\/p>","heading-5":"Do you offer international shipping?","content-5":"<p>Currently, we only offer shipping within the UAE. We are dedicated to providing exceptional service to our UAE-based customers, and we hope to expand our shipping options internationally in the future.<\/p>"}},"faq_94mpBw":{"type":"faq","settings":{"select_topic":"shipping","heading-1":"How can I track my order?","content-1":"<p>After placing your order, you can monitor its progress by clicking the <a href=\"https:\/\/yandco.com\/apps\/trackorder\" title=\"https:\/\/yandco.com\/apps\/trackorder\"><span style=\"text-decoration:underline\"><strong>Track Order<\/strong><\/span><\/a> option on our website. If you need further assistance with tracking, please don’t hesitate to contact our customer support team.<\/p>","heading-2":"","content-2":"","heading-3":"","content-3":"","heading-4":"","content-4":"","heading-5":"","content-5":""}},"faq_kC7eT8":{"type":"faq","settings":{"select_topic":"return_and_exchanges","heading-1":"What is your return policy?","content-1":"<p>At Y&CO, we want you to be completely satisfied with your purchase. If for any reason you are not, we offer a <strong>15-days return policy<\/strong> from the date of delivery for unused and unworn items in their original packaging, with tags attached. Some items may be excluded from returns due to hygiene reasons.<\/p><p>If your products fall under these, then your return won’t work.<\/p><p>●       Items on sale<\/p><p>●       Personalized items<\/p><p>●       Products with extended delivery time<\/p><p>●       Products on <strong>‘Special Sale’<\/strong> categories<\/p><p>●       Products without the original packaging and tags<\/p><p>●       Products not having the original packaging, logos etc.<\/p><p>Products not in pristine condition or having proof of use, tear, or altered<\/p>","heading-2":"How do I initiate a return or exchange?","content-2":"<p>To initiate a return or exchange, please contact our customer service team with your order number and the reason for the return. Our team will guide you through the process and provide instructions on how to return your item. Once we receive the returned item, we’ll process the exchange or issue a refund, depending on your preference.<\/p>","heading-3":"How do I cancel my exchange request?","content-3":"<p>If you need to cancel an exchange request, contact our customer service team as soon as possible, and they will assist you in stopping the exchange process.<\/p>","heading-4":"Can I exchange my product(s) after the window has expired?","content-4":"<p>We accept exchange items purchased within 15 days of receipt. If the exchange window has expired, we cannot accept the request.<\/p>","heading-5":"Will I be able to place an exchange order if the original product's price changes?","content-5":"<p>Yes, you can still place an exchange request if the price of the original item changes. However, any additional costs or price adjustments will be communicated to you before the exchange is processed, especially if the exchange item has a different price.<\/p>"}},"faq_pPMGG4":{"type":"faq","settings":{"select_topic":"return_and_exchanges","heading-1":"Why am I no longer able to exchange the product(s)?","content-1":"<p>If the exchange option is unavailable, it may be because the item is past the exchange window, the item is final sale, or there are no remaining stock options for an exchange. Please check your order details and our policy for further clarification.<\/p>","heading-2":"Why was my request for exchange rejected?","content-2":"<p>An exchange request may be rejected for reasons such as the item being outside the exchange window, signs of wear or damage, missing original tags, or lack of stock availability for the replacement item. If you have questions, please contact our customer support for more information.<\/p>","heading-3":"When will my exchange order be placed?","content-3":"<p>Your exchange order will be placed once we receive the item you are returning and verify that it meets our exchange conditions. After verification, we will proceed with processing the replacement item for shipping.<\/p>","heading-4":"How do I exchange multiple product(s) from a single order?","content-4":"<p>To exchange multiple items from a single order, contact our customer service team. They will guide you through the process. <\/p>","heading-5":"What if my item is damaged or defective upon arrival?","content-5":"<p>If you receive an item that is damaged or defective, please reach out to us immediately with your order number and a photo of the item. We will arrange for a replacement or a full refund, as per your preference. Your satisfaction is our priority, and we strive to resolve any issues promptly.<\/p>"}},"faq_3RHNpj":{"type":"faq","settings":{"select_topic":"return_and_exchanges","heading-1":"If I’m eligible for a refund, when will I receive it?","content-1":"<p>Once your returned item has been received and inspected, we will process your refund. Refunds typically take <strong>5-7 business days<\/strong> to reflect on your original payment method, depending on your bank or payment provider. You will receive a confirmation email once your refund has been issued.<\/p>","heading-2":"","content-2":"","heading-3":"","content-3":"","heading-4":"","content-4":"","heading-5":"","content-5":""}},"faq_G8N4Up":{"type":"faq","settings":{"select_topic":"products_and_sizing","heading-1":"What types of fabric do you use to weave kidswear?","content-1":"<p>At Y&CO, we prioritize fabrics that are eco-friendly and free from harmful chemicals to ensure safety and comfort for your child. Our kidswear is crafted from certified materials that are breathable, durable, and gentle materials, great for kids’ sensitive skins.<\/p>","heading-2":"Where are Y&CO products made?","content-2":"<p>Y&CO is committed to quality and ethical production practices. We are the sole manufacturer of the clothing products offered at Y&CO, which are made in our factories. Our products are designed with care and made in facilities that prioritize fair labor practices and environmentally-friendly manufacturing.<\/p>","heading-3":"What sizes are available for your kids' clothes?","content-3":"<p>Our clothing range at Y&CO is designed to fit children aged 3 to 12 years. We offer sizes that align with typical age and height measurements, ensuring a comfortable fit. Please refer to our size guide on each product page for detailed measurements and tips on selecting the right size for your child.<\/p>","heading-4":"How do I choose the right size for my child?","content-4":"<p>We provide a detailed size guide on each product page to help you select the perfect fit. Simply measure your child’s height, chest, waist, and hips, then refer to our size chart for the best match.<\/p>","heading-5":"What types of clothing does Y&CO offer?","content-5":"<p>Y&CO offers a wide range of stylish and comfortable clothing for kids of all ages, including casual wear, outerwear, and seasonal collections. We focus on trendy designs, eco-friendly materials, and kid-friendly styles.<\/p>"}},"faq_yRFWqY":{"type":"faq","settings":{"select_topic":"products_and_sizing","heading-1":"Does Y&CO offer seasonal collections?","content-1":"<p>Yes, Y&CO releases seasonal collections to keep up with the latest trends and needs, from cozy winter essentials to breezy summer styles. Each collection is curated to offer your kids fashion-forward and practical options for every season.<\/p>","heading-2":"Can I wash Y&CO clothes in the machine?","content-2":"<p>Absolutely! Most Y&CO items are machine-washable for easy care. However, please check the care information in the product description for each garment for specific washing instructions to keep them looking their best.<\/p>","heading-3":"Do your clothes shrink after washing?","content-3":"<p>Y&CO clothing is designed with quality materials to minimize shrinkage. We recommend following the care instructions in the product description for each garment to preserve the fabric’s integrity and fit. For best results, wash on a gentle cycle and avoid high heat when drying.<\/p>","heading-4":"Do you offer Y&CO clothing in adult sizes?","content-4":"<p>Y&CO specializes exclusively in kids' clothing for ages 3 to 12 years. We focus on creating eco-friendly, stylish, and comfortable options specifically designed for children. At this time, we do not offer adult sizes, but our collection is perfect for kids who love fun and comfortable fashion!<\/p>","heading-5":"","content-5":""}},"faq_h6gCw9":{"type":"faq","settings":{"select_topic":"sustainability","heading-1":"What sustainable practices does Y&CO follow?","content-1":"<p>Sustainability is central to Y&CO’s mission. We prioritize eco-friendly materials, responsible sourcing, and efficient production processes to reduce waste.<\/p>","heading-2":"Are your materials safe and child-friendly?","content-2":"<p>bsolutely. We carefully select materials that are safe for sensitive skin and comfortable for all-day wear. Our fabrics are free from harmful chemicals and adhere to strict quality and safety standards, ensuring each piece is both stylish and safe for your child.<\/p><p>Materials percentage.<\/p>","heading-3":"Are Y&CO products eco-friendly?","content-3":"<p>We are committed to sustainability and eco-friendly practices. Our collections use responsibly sourced materials wherever possible, and we continue to innovate and reduce our environmental impact.<\/p>","heading-4":"","content-4":"","heading-5":"","content-5":""}},"faq_zQgwLH":{"type":"faq","settings":{"select_topic":"support","heading-1":"How can I contact Y&CO for assistance?","content-1":"<p>Our customer service team is here to help with any questions you may have! You can reach us via email, social media, or live chat on our website during business hours. We’ll be happy to assist you.<\/p>","heading-2":"Do you offer live chat or other support options?","content-2":"<p>Yes, Y&CO offers several convenient support options. You can reach our customer service team via live chat on our website during business hours, or by email and social media. Our team is here to help with any questions you may have about our products or your order.<\/p>","heading-3":"","content-3":"","heading-4":"","content-4":"","heading-5":"","content-5":""}},"faq_QhEVFK":{"type":"faq","settings":{"select_topic":"promotions","heading-1":"How do I apply a promo code at checkout?","content-1":"<p>To apply a promo code, enter the code in the designated promo code box at checkout. Once entered, the discount will be applied to your order total. Please make sure to check that the code is valid and hasn't expired.<\/p>","heading-2":"Can I use more than one promo code on my order?","content-2":"<p>Unfortunately, only one promo code can be used per order. If you have multiple promo codes, choose the one that offers the best discount for your purchase.<\/p>","heading-3":"Why isn’t my promo code working?","content-3":"<p>Promo codes may not work for several reasons: <strong>the code may be expired, not valid for certain items in your cart, or may require a minimum purchase<\/strong>. If you're having trouble, please reach out to our customer service team.<\/p>","heading-4":"Do promotions apply to sale items?","content-4":"<p>Promotions may or may not apply to sale items, depending on the terms of the promotion. Some codes are valid only on full-priced items. Please check the specific details of each promotion for more information.<\/p>","heading-5":"How long do promotions last?","content-5":"<p>The duration of each promotion varies. Please check the specific promotion details for start and end dates, or contact our customer service team if you have any questions.<\/p>"}},"faq_8zkp9i":{"type":"faq","settings":{"select_topic":"promotions","heading-1":"How can I find out about upcoming promotions?","content-1":"<p>To stay updated on our latest promotions, sign up for our newsletter and follow us on social media. You’ll be the first to hear about exclusive discounts, seasonal sales, and more.<\/p>","heading-2":"","content-2":"","heading-3":"","content-3":"","heading-4":"","content-4":"","heading-5":"","content-5":""}},"faq_9rDjrK":{"type":"faq","settings":{"select_topic":"accounts","heading-1":"Do I need to create an account to order online?","content-1":"<p>We encourage our customers to create an online account when ordering, but you can always check out as a <strong>Guest<\/strong> if you prefer.<\/p>","heading-2":"How can I recover my account’s password?","content-2":"<p>If you've forgotten your password, simply go to the login page and click <strong>Forgot Password<\/strong>. Enter the email associated with your account, and we'll send you a link to reset your password. Follow the instructions in the email, and you’ll be able to set a new password and regain access to your account.<\/p>","heading-3":"","content-3":"","heading-4":"","content-4":"","heading-5":"","content-5":""}}},"block_order":["faq_tqbG3N","faq_NncJLL","faq_8GHXb6","faq_T7NygX","faq_QWAAEB","faq_AUHQwH","faq_RdcjKH","faq_94mpBw","faq_kC7eT8","faq_pPMGG4","faq_3RHNpj","faq_G8N4Up","faq_yRFWqY","faq_h6gCw9","faq_zQgwLH","faq_QhEVFK","faq_8zkp9i","faq_9rDjrK"],"settings":{"subtitle":"Find answers to all your questions! We’ve compiled everything  you need to know to make your experience seamless.","overwrite_colors":true,"color":"#000000","background":"#ffffff","enable_wide":false,"flip":false,"aspect_ratio_desktop":"media--4-3","aspect_ratio_mobile":"media--mobile-1-1"}}},"order":["default"]}