{"sections":{"default":{"type":"privacy-policy-v2","blocks":{"policy_hMPGt6":{"type":"policy","settings":{"heading":"Welcome","content":"<p>Welcome to Y&CO! (Powered by Y N C APPAREL TRADING L.L.C) We are committed to ensuring your privacy and security when you engage with us. Our Privacy Policy outlines how we safeguard your information.<\/p>"}},"policy_tPgbeC":{"type":"policy","settings":{"heading":"Your Privacy Matters","content":"<p>Your privacy is important to us, and we strive to maintain the confidentiality of any information you share with us.<\/p>"}},"policy_xb4GtP":{"type":"policy","settings":{"heading":"Information We Collect","content":"<p>When you interact with our website or use our services, we may gather certain information to enhance your experience. This information may include:<\/p><ul><li>Personal Information: This includes details like your name, email address, contact number, and shipping address. We collect this information when you make a purchase or contact us for support.<\/li><li>Non-Personal Information: We may collect general data such as your IP address, browser type, and device information to improve our website's functionality and performance.<\/li><\/ul><p>Cookies: Like many websites, we use cookies to enhance your browsing experience. These cookies help us understand your preferences and optimize our website accordingly.<\/p>"}},"policy_ji73Be":{"type":"policy","settings":{"heading":"How We Use Your Information","content":"<p>We use the information we collect for various purposes, including:<\/p><ul><li>Order Processing: To process your orders and ensure timely delivery of your purchases.<\/li><li>Communication: To keep you informed about your orders, promotions, and updates related to our brand.<\/li><li>Improving Our Services: To analyze website traffic and trends, helping us enhance your browsing experience.<\/li><\/ul><p>Personalization: To tailor our offerings to your preferences and provide you with a customized shopping experience.<\/p>"}},"policy_FrWhHP":{"type":"policy","settings":{"heading":"Whom We May Share Your Information","content":"<p>We may share your personal information: <br\/><br\/><strong>Third-party service providers:<\/strong><br\/><br\/>As we collaborate with various service providers, therefore, your personal data (Name and Cell No) may be shareable with them only when it is absolutely necessary to fulfill the services we are receiving from them. This includes but is not limited to software systems, cloud hosting service providers, order fulfillment & delivery, etc. Our third-party service providers are not granted permission to use or share any information they receive from us other than the purpose of providing the services to us. <br\/><br\/><strong>For any legal reasons:<\/strong><br\/><br\/>In response to comply with UAE government agencies, law enforcement, or public authorities requests, we may disclose your data to them. <br\/><br\/>To secure our rights, systems, services, and users. <br\/><br\/>In the event of joint venture, restructure, merger, or any disposition of our business, stocks completely or partially.<br\/><br\/><strong>Information Sharing and Disclosure<\/strong><br\/>We do not share your information with third parties, except in cases where it is necessary to fulfill your orders or comply with legal requirements.<\/p><p>https:\/\/www.yandco.ae\/  is not responsible for the privacy policies of websites to which it links. If you provide any information to such third parties different rules regarding the collection and use of your personal information may apply. You should contact these entities directly if you have any questions about their use of the information that they collect.<\/p>"}},"policy_YjGX8w":{"type":"policy","settings":{"heading":"Lawful Basis","content":"<p>We process your personal information under the following lawful bases:<\/p><p>Your consent;<\/p><p>To protect your vital interests;<\/p><p>to comply with our website's legal obligations;<\/p><p>The performance of the contract between you and the Site;<\/p><p>For our legitimate interests, by not overriding your fundamental rights.<\/p>"}},"policy_bkqcE3":{"type":"policy","settings":{"heading":"Information Sharing and Disclosure","content":"<p>We do not share your information with third parties without your consent, except in cases where it is necessary to fulfill your orders or comply with legal requirements.<\/p><p>Y&CO does not save or store any credit\/debit card information. We value our customers' privacy and do not store, sold, shared, rented or leased, any payment information to any third parties.<\/p>"}},"policy_NjL7tz":{"type":"policy","settings":{"heading":"Data Security","content":"<p>We take the security of your information seriously and employ industry-standard measures to safeguard it. However, please note that no method of transmission over the internet is entirely secure.<\/p>"}},"policy_GMBLC9":{"type":"policy","settings":{"heading":"Your Choices","content":"<p>You have the right to access, update, or delete your personal information stored in our systems. Additionally, you can opt out of receiving marketing communications from us at any time.<\/p>"}},"policy_Wfq9B3":{"type":"policy","settings":{"heading":"Children's Privacy","content":"<p>Our website is intended for children under the age of 13, as well as parents or guardians shopping on behalf of their children.<\/p>"}},"policy_M7XDq8":{"type":"policy","settings":{"heading":"Changes to This Privacy Policy","content":"<p>We may update our Privacy Policy periodically to reflect changes in our practices or legal requirements. Any significant updates will be communicated to you through our website.<\/p>"}},"policy_QeMdgD":{"type":"policy","settings":{"heading":"Contact us","content":"<p>If you have any questions or concerns about our Privacy Policy or how we handle your information, please feel free to reach out to Y&CO(Powered by Y N C APPAREL TRADING L.L.C ).<br\/><br\/>By using our website or services, you consent to the terms outlined in this Privacy Policy. Your privacy is our priority, and we are committed to protecting your information every step of the way.<\/p>"}}},"block_order":["policy_hMPGt6","policy_tPgbeC","policy_xb4GtP","policy_ji73Be","policy_FrWhHP","policy_YjGX8w","policy_bkqcE3","policy_NjL7tz","policy_GMBLC9","policy_Wfq9B3","policy_M7XDq8","policy_QeMdgD"],"settings":{"subtitle":"A Privacy Policy explains how we collect, use, and protect your  personal information when you interact with our services."}}},"order":["default"]}